cases/scrivenWedge/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default              Gauss linear;
//    grad(alpha.liquid)   pointCellsLeastSquares;
//    grad(alpha.vapour)   pointCellsLeastSquares;
//    nHat                 pointCellsLeastSquares;
} 

divSchemes
{
    div(rhoPhi,U)                Gauss limitedLinearV 1;
    div(rhoPhiCp,T)              Gauss limitedLinear 1;
    div(phi,alpha)               Gauss vanLeer;
    div(phirb,alpha)             Gauss interfaceCompression;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,p_rgh)               Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}


snGradSchemes
{
    default              orthogonal;
}

fluxRequired
{
    default         none;
    p_rgh;
    pcorr;
    alpha.liquid;
}


// ************************************************************************* //
